app/Controllers/CatalogoController.php

    public function index()
    {
        $model = new CatalogoModel();

        // Recupera tutti i prodotti dal database
        $prodotti = $model->findAll();
---
SELECT *
FROM "catalogo"