app/Models/UserModel.php

INSERT INTO "users" ("nome", "email", "password") VALUES ('Pippo1', 'pippo1@gmail.com', '$2y$10$S13.dWUoShMTMMgh9ZrP8OQIKyPFX0nJ5Ziu2zKrOCmW4HfR4SgvK')
---
    public function registerUser($data) {
        return $this->insert($data);